Repository: scriptonist/teknolab-wapiti
Catalog: src/language_sources/*.po
Languages: es, fr

source: No links or forms found in this page !
es: ¡No se han encontrado enlaces ni formularios en esta página!
fr: Aucun liens ni formulaires trouvés dans cette page !

source: Make sure the url is correct.
es: Asegúrate de que la URL es correcta
fr: Assurez vous que l'url est valide.

source: Attacking urls (GET)
es: Atacando URL (GET)
fr: Attaque des urls (GET)

source: Attacking forms (POST)
es: Atacando formularios (POST)
fr: Attaque des formulaires (POST)

source: Looking for permanent XSS
es: Buscando XSS permantentes
fr: Recherche de XSS permanents

source: Upload scripts found
es: Scripts de upload encontrados
fr: Scripts d'upload trouvés

source: Report
es: Informe
fr: Rapport

source: A report has been generated in the file
es: Un informe ha sido generado en el fichero
fr: Un rapport a été généré dans le fichier

source: Open
es: Abre
fr: Ouvrez

source: with a browser to see this report.
es: con un navegador para ver el informe
fr: avec un navigateur pour voir ce rapport.

source: attackGET
es: Ataque GET

source: attackPOST
es: Ataque POST

source: wapityDoc
es: Wapiti - Escáner de vulnerabilidades de aplicaciones web Uso: python wapiti.py http://server.com/base/url/ [opciones] Las opciones soportadas son: -s <url> --start <url> Para especificar una URL con la que empezar -x <url> --exclude <url> Para excluir una URL del análisis (por ejemplo scripts de logout) También se permite el uso del comodín (*) Ejemplo: -x http://server/base/?page=*&module=test o -x http://server/base/admin/* para excluir un directorio -p <url_proxy> --proxy <url_proxy> Especifica un proxy Ejemplo: -p http://proxy:port/ -c <cookie_file> --cookie <cookie_file> Para usar una cookie -t <timeout> --timeout <timeout> Establece el tiempo del timeout (en segundos) -a <login%password> --auth <login%password> Establece credenciales para autenticación HTTP No funciona con Python 2.4 -r <parameter_name> --remove <parameter_name> Borra un parámetro de las URL -n <limit> --nice <limit> Define el límite de URL a leer con el mismo patrón Usar esta opción para prevenir bucles infinitos Este parámetro debe ser mayor de 0 -m <module_options> --module <module_options> Indica los módulos y métodos HTT que van a ser usados en los ataques. Ejemplo: -m "-all,xss:get,exec:post" -u --underline Para resaltar en color los parámetros de las vulnerabilidades en la salida -v <level> --verbose <level> Establece el nivel de logs por pantalla 0: silencioso (default), 1: pinta cada URL, 2: pinta cada ataque -b <scope> --scope <scope> Establece el ambito del escaneo de Wapiti: + "page": para analizar solamente la página pasada en la URL + "folder": para analizar todos los enlaces a las página que están en la misma caperta que la de la URL pasada a Wapiti. + "domain": para analizar todos los enlaces a las página que están en el mismo dominio que la de la URL pasada a Wapiti. Si el ámbito no se indica, Wapiti escanea todo el árbol bajo la URL dada. -f <type_file> --reportType <type_file> Establece el tipo de informe xml: Informe en formato XML html: Informe en formato HTML -o <output> --output <output_file> Establece el nombre del informe Si el tipo de informe seleccionado es HTML, este parámetro debe ser un directorio -i <file> --continue <file> Este parámetro indica a Wapiti que debe continuar el escaneo a partir de los datos del archivo especificado. Este fichero debe contener información de un escaneo previo. El fichero es opcional, si no se especifica, Wapiti toma un archivo por defecto de la carpeta "scans". -k <file> --attack <file> Este parámetro le indica a Wapiti que debe realizar los ataques sin escanear de nuevo el sitio web, siguiendo la información del fichero que se le pasa. El fichero es opcional, si no se especifica, Wapiti toma un archivo por defecto de la carpeta "scans". -h --help Para sacar este mensaje de uso de Wapiti
fr: Wapiti-SVN - Un scanneur de vulnérabilités pour applications web Mode d'emploi : python wapiti.py http://server.com/base/url/ [options] Les options possibles sont les suivantes : -s <url> --start <url> Commencer le scan par l'url spécifiée -x <url> --exclude <url> Pour exclure une url du scan (par exemple un script de déconnexion) L'usage de l'astérisque (*) est autorisé Exemple : -x http://server/base/?page=*&module=test ou -x http://server/base/admin/* pour exclure un répertoire -p <url_proxy> --proxy <url_proxy> Spécifier l'utilisation d'un proxy Exemple: -p http://proxy:port/ -c <cookie_file> --cookie <cookie_file> Utiliser un cookie pour les requêtes -t <timeout> --timeout <timeout> Définir le temps d'attente (en secondes) -a <login%password> --auth <login%password> Spécifier des identifiants pour l'authentification HTTP -r <parameter_name> --remove <parameter_name> Retirer un paramêtre de toutes les URLs -n <limit> --nice <limit> Définir une limite pour le nombre d'urls à traiter basées sur le même format (pattern) Utiliser cette option pour éviter d'entrer dans des boucles infinies Cette valeur doit être supérieur à 0 -b <scope> --scope <scope> Définir le périmêtre du scan : + "page" : analyser uniquement la page passée dans l'URL + "folder" : analyser toutes les pages trouvées dans l'arborescence passée comme URL à Wapiti. + "domain" :analyser toutes les pages trouvées dans le domaine spécifié dans l'URL passée à Wapiti. Par défaut, Wapiti scanne l'arborescence sous l'URL définie en argument principal. -m <module_options> --module <module_options> Définir les modules et les méthodes HTTP associées à utiliser pour les attaques. Exemple: -m "-all,xss:get,exec:post" -u --underline Utiliser les couleurs du terminal pour mettre en valeur les paramêtres vulnérables -v <level> --verbose <level> Définie la verbosité des résultats 0: silencieux (défaut), 1: affiche chaque url, 2: affiche chaque attaque en détail -f <type_file> --reportType <type_file> Définir le format du rapport xml: Rapport au format XML html: Rapport au format HTML txt: Rapport au format texte simple -o <output> --output <output_file> Spéficier le nom du fichier où enregistrer le rapport Si le rapport est au format html, ce paramêtre doit être un répertoire -i <file> --continue <file> Reprendre une session de scan en chargeant les paramêtres sauvegardés dans le fichier. Si le paramêtre est appelé sans argument, Wapiti charge la session depuis un fichier par défaut présent dans le dossier "scans". -k <file> --attack <file> Lancer directement les attaques en chargeant les URLs présentes dans ce fichier (ne pas laisser lswww faire un scan préalable). Si le fichier n'est pas spécifié, Wapiti charge un fichier par défaut dans le dossier "scans". -h --help Afficher ce message d'aide

source: Invalid link argument
es: Argumento link (URL) inválido
fr: Le lien passé en argument est invalide

source: Forms Info
es: Información de los formularios
fr: Infos sur les formulaires

source: From
es: De
fr: En provenance de

source: To
es: A
fr: vers

source: Upload Scripts
es: Scripts de subida
fr: Scripts d'upload

source: Forms
es: Formularios
fr: Formulaires

source: Form
es: Formulario
fr: Formulaire

source: Method
es: Metodo
fr: Méthode

source: Intputs
es: Entradas
fr: Inputs

source: Selects
es: Seleccionables (Selects)

source: TextAreas
es: Áreas de texto

source: lswwwDoc
es: lswww explora un sitio web y extrae los enlaces y formularios (incluyendo sus campos). Usage: python lswww.py http://server.com/base/url/ [opciones] Las opciones soportadas son: -s <url> --start <url> Para especificar una URL con la que empezar -x <url> --exclude <url> Para excluir una URL del análisis (por ejemplo scripts de logout) También se permite el uso del comodín (*) Ejemplo: -x http://server/base/?page=*&module=test o -x http://server/base/admin/* para excluir un directorio -p <url_proxy> --proxy <url_proxy> Especifica un proxy Ejemplo: -p http://proxy:port/ -c <cookie_file> --cookie <cookie_file> Para usar una cookie -a <login%password> --auth <login%password> Establece credenciales para autenticación HTTP No funciona con Python 2.4 -r <parameter_name> --remove <parameter_name> Borra un parámetro de las URL -v <level> --verbose <level> Establece el nivel de logs 0: only print results 1: pinta un punto (.) por cada URL encontrada (logs por defecto) 2: pinta cada URL -t <timeout> --timeout <timeout> Establece el tiempo del timeout (en segundos) -n <limit> --nice <limit> Define el límite de URL a leer con el mismo patrón Usar esta opción para prevenir bucles infinitos Este parámetro debe ser mayor de 0 -b <scope> --scope <scope> Establece el ambito del escaneo de Wapiti: + "page": para analizar solamente la página pasada en la URL + "folder": para analizar todos los enlaces a las página que están en la misma caperta que la de la URL pasada a Wapiti. + "domain": para analizar todos los enlaces a las página que están en el mismo dominio que la de la URL pasada a Wapiti. Si el ámbito no se indica, Wapiti escanea todo el árbol bajo la URL dada. -i <file> --continue <file> Este parámetro indica a Wapiti que debe continuar el escaneo a partir de los datos del archivo especificado. Este fichero debe contener información de un escaneo previo. El fichero es opcional, si no se especifica, Wapiti toma un archivo por defecto de la carpeta "scans". -h --help Para sacar este mensaje de uso de Wapiti
fr: lswww explore un site web et extrait les liens et formulaires trouvés. Mode d'emploi : python lswww.py http://server.com/base/url/ [options] Les options disponibles sont : -s <url> --start <url> Commencer le scan par l'url spécifiée -x <url> --exclude <url> Exclure une url du scan (par exemple les scripts de déconnexion) L'utilisation de l'astérisque (*) est autorisée Exemple : -x http://server/base/?page=*&module=test ou -x http://server/base/admin/* to exclude a directory -p <url_proxy> --proxy <url_proxy> Spécifier un proxy à utiliser Exemple: -p http://proxy:port/ -c <cookie_file> --cookie <cookie_file> Utiliser un cookie pour les requêtes -a <login%password> --auth <login%password> Définir des identifiants pour l'authentication HTTP -r <parameter_name> --remove <parameter_name> Retirer un paramêtre de chaque URL -v <level> --verbose <level> Définir le niveau de verbosité 0: afficher uniquement les résultats 1: afficher un point pour chaque url trouvée (défaut) 2: afficher chaque url au moment de leur découverte -t <timeout> --timeout <timeout> Définir un temps d'attente (en secondes) -n <limit> --nice <limit> Definir une limite d'urls à traiter formées sur le même modèle (pattern) Cette option peut empêcher de tomber dans des boucles infinies de scan La valeur doit être supérieure à 0 -b <scope> --scope <scope> Définir le périmêtre du scan : + "page" : analyser toutes les pages présentes sous l'URL principale + "folder" : analyser toutes les pages présentes sous la même arborescence que la page passée en argument principal à Wapiti. + "domain" : analyser toutes les pages sous le même domaine que l'URL principale passée à Wapiti. Si aucun argument n'est définie, Wapiti scanne chaque page sous l'URL principale.. -i <file> --continue <file> Reprendre une précédente session de scan là où elle avait été laissée en chargeant les données depuis le fichier spécifié en paramêtre. Si aucun fichier n'est spécifié, Wapiti se sert d'un fichier de sauvegarde par défaut présent dans le dossier "scans". -h --help Afficher ce message d'aide

source: CRLF Injection (QUERY_STRING) in
es: Inyección CRLF (QUERY_STRING) en
fr: Injection CRLF (QUERY_STRING) dans

source: Evil url
es: URL vulnerable
fr: URL malicieuse

source: Timeout (QUERY_STRING) in
es: Timeout (QUERY_STRING) en
fr: Timeout (QUERY_STRING) dans

source: caused by
es: causado por
fr: provoqué par

source: in
es: en
fr: dans

source: Timeout in
es: Timeout en
fr: Timeout dans

source: (QUERY_STRING) in
es: (QUERY_STRING) en
fr: (QUERY_STRING) dans

source: 500 HTTP Error code with
es: Error HTTP 500 con
fr: Code d'erreur HTTP 500 avec

source: with params
es: con parámetros
fr: avec les paramêtres

source: coming from
es: viniendo de
fr: en provenance de

source: Timeout coming from
es: Timeout viniendo de
fr: Timeout en provenance de

source: 500 HTTP Error code coming from
es: Error HTTP 500 viniendo de
fr: Code d'erreur HTTP 500 en provenance de

source: 500 HTTP Error code in
es: Error HTTP 500 en
fr: Erreur HTTP 500 dans

source: Blind SQL Injection (QUERY_STRING)
es: Inyección ciega SQL (QUERY_STRING)
fr: Injection SQL aveugle (QUERY_STRING)

source: Blind SQL Injection (QUERY_STRING) in
es: Inyección ciega SQL (QUERY_STRING) en
fr: Injection SQL aveugle (QUERY_STRING) dans

source: Blind SQL Injection
es: Inyección ciega SQL
fr: Injection SQL aveugle

source: Blind SQL Injection coming from
es: Inyección ciega SQL viniendo de
fr: Injection SQL aveugle en provenance de

source: Blind SQL Injection in
es: Inyección ciega SQL en
fr: Injection SQL aveugle dans

source: Found permanent XSS in
es: Encontrado XSS permanente en
fr: XSS permanent trouve dans

source: with
es: con
fr: avec

source: Found permanent XSS attacked by
es: Encontrados XSS permanentes atacados mediante
fr: XSS permanent XSS en provenance de

source: with field
es: con campo
fr: avec le champ

source: attacked by
es: atacado por
fr: en provenance de

source: with fields
es: con campos
fr: avec les champs

source: Found XSS in
es: Encontrado XSS en
fr: XSS trouvé dans

source: 500 HTTP Error code.
es: Error HTTP 500

source: 500 Error description
es: Error interno del servidor. El servidor encontró una condición inesperada que le impide llevar a cabo la solicitud.<ul> <li><a href='http://www.w3.org/Protocols/rfc2616/rfc2616-sec10.html#sec10.5'> Consorcio World Wide Web: HTTP/1.1 Definiciones de códigos de estado (en inglés) </a></li> <li><a href='http://en.wikipedia.org/wiki/List_of_HTTP_status_codes#5xx_Server_Error'> Wikipedia: Lista de códigos de estado de HTTP (en inglés) </a></li></ul>
fr: Description du code d'erreur 500Erreur interne au serveur. Le serveur a fait face à une situation inattendue qui l'a empêché de traiter convenablement la requête.<ul> <li><a href='http://www.w3.org/Protocols/rfc2616/rfc2616-sec10.html#sec10.5'> World Wide Web Consortium: HTTP/1.1 Status Code Definitions </a></li> <li><a href='http://en.wikipedia.org/wiki/List_of_HTTP_status_codes#5xx_Server_Error'> Wikipedia: Liste des codes de status HTTP </a></li></ul>

source: SQL Injection
es: Inyección SQL
fr: Injection SQL

source: SQL Injection description
es: La inyección SQL es una técnica que explota una vulnerabilidad que ocurre en la base de datos de una aplicación.
fr: Les injections SQL sont une technique qui exploite une vulnérabilité qui s'exécute au sein d'une base de donnée.

source: SQL Injection solution
es: Para protegerse contra las inyecciones SQL, las entradas de información que el usuario introduce en la aplicación no deben ser directamente colocadas en sentencias SQL. En vez de eso, las entradas deben ser limipiadas, filtradas o bien se deben usar sentencias parametrizadas.
fr: Pour se protéger des injections SQL, les données fournies par les utilisateurs ne doivent pas être utilisées telles-quelles dans les requêtes SQL mais doivent faire l'objet de vérifications (filtres, échappements) approfondies.

source: Blind SQL Injection description
es: La inyección SQL ciega es una técnica que explota una vulnerabilidad que ocurre en la base de datos de una aplicación. Este tipo de vulnerabilidad es más difícil de detectar que la inyección SQL normal porque no muestra mensajes de error en la página web.
fr: Les techniques d'injections SQL en aveugle exploite des vulnérabilités qui s'exécutent au sein d'une base de données. Ce type de vulnérabilités est plus difficile à détecter en raison de l'absence de messages d'erreur renvoyés par l'application web.

source: Blind SQL Injection solution
es: Para protegerse contra las inyecciones SQL, las entradas de información que el usuario introduce en la aplicación no deben ser directamente colocadas en sentencias SQL. En vez de eso, las entradas deben ser limipiadas, filtradas o bien se deben usar sentencias parametrizadas.
fr: Pour se protéger des injections SQL, les données fournies par les utilisateurs ne doivent pas être utilisées telles-quelles dans les requêtes SQL mais doivent faire l'objet de vérifications (filtres, échappements) approfondies.

source: File Handling
es: Manejo de archivos
fr: Attaques sur la gestion des fichiers

source: File Handling description
es: Este ataque es también conocido como Path Transversal o Directory Transversal, su objetivo es acceder a directorios y ficheros que son almacenados fuera del directorio en el que se encuentra la aplicación web. El atacante intenta explorar los ditectorios guardados en el servidor web usando algunas técnicas como por ejemplo, la manipulación de variables que referencian ficheros con secuencias de 'punto punto barra (../)' y sus variantes para moverse hasta el directorio raíz para navegar a través del sistema de archivos.
fr: Ces techniques permet à l'attaquant d'accèder à des fichiers auxquels il n'est pas sensé accèder car en dehors de la racine du serveur web. En utilisant certaines séquences comme '../', il peut remonter dans l'arborescence pour ainsi lister des répertoires ou obtenir le contenu de fichiers.

source: File Handling solution
es: Es preferible no usar las entradas de un usuario cuando se manejan llamadas al sistema de ficheros<br>Usar índices mejor que porciones del nombre del fichero cuando se usen ficheros de lenguaje (por ejemplo el valor 5 para la entrada de datos de usuario por el nombre Checoslovaco, en vez de esperar que el usuario introduzca 'Checoslovaco').<br>Asegurar que el usuario no pueda acceder a la ruta entera de un fichero.<br>Validar la entrada de datos del usuario, solo aceptando las rutas que son conocidas.<br>Usar jaulas (chrooted jails) y tener políticas de acceso para restringir por quien puede ser leído o escrito un fichero.
fr: Ne laissez pas aux utilisateurs la possibilité de choisir une ou plusieurs parties du nom d'un fichier ou d'un répertoire. Générez vous même des noms aléatoire en cas de création ou utilisez des correspondances en cas de templates (un ID numérique correspondant à une chaine de caractères.<br />Utilisez des jails chroot et des restrictions d'accès pour limiter le nombre de fichiers accessibles par le serveur.

source: Cross Site Scripting description
es: Cross-site scripting (XSS) es un tipo de vulnerabilidad que se encuentra en aplicaciones web que permite la inyección de código por usuarios maliciosos dentro de las páginas vistas por otros usuarios. Normalmente el código inyectado suele ser HTML y lenguajes del lado cliente, como JavaScript.
fr: Le Cross-site scripting (XSS) est une catégorie de vulnérabilités web qui permet d'exécuter du code dans le navigateur des visiteurs du site. Leur exploitation peut par exemple permettre le détournement d'une session qui a été ouverte sur un site par un utilisateur valide.

source: Cross Site Scripting solution
es: La mejor forma de proteger una aplicación web de los ataques XSS es asegurarse de que la aplicacion realiza validaciones sobre todas las cabeceras, cookies, query strings, campos de formularios y campos ocultos. La codificación de los datos proporcionados por el usuario en el servidor puede servir para defenderse de vulnerabilidades XSS mediante la prevencion de inserción de script transmitidos por los usuarios desde formularios. Las aplicaciones estarán mejor protegidas de los ataques basados en JavaScript mediante la conversión apropiada codificación en HTML de los siguientes caracteres: &lt;, &gt;, &amp;, &quot;, ', (, ), #, %, ; , +, -
fr: Afin de se protéger des attaques XSS, il faut s'assurer que les données retournées dans une page ne contiennent pas certains caractères interprétés par le navigateur.<br />Certains caractères considérés dangereux peuvent être remplacés par leur code d'entité HTML.

source: CRLF description
es: El término CRLF se refiere al retorno de carro (ASCII 13, \r) y al salto de línea(ASCII 10, \n). Suelen usarse para delimitar la terminación de una línea, sin embargo, funcionan de forma diferente en los sistemas operativos más populares hoy en día. Por ejemplo: en Windows tanto el retorno de carro (CR) como el salto de línea (LF) son requeridos para indicar el final de la línea, mientras que en Linux/UNIX solo se necesita un salto de línea (LF). Esta combinación de retorno de carro y salto de línea se usa por ejemplo cuando se presiona 'Intro' en el teclado. Dependiendo de la aplicación que se esté usando, la presión de 'Intro' normalmente indica a la aplicación el comienzo de una nueva línea o el envío de un comando.
fr: Le terme CRLF fait référence à Carriage Return (ASCII 13, \r) Line Feed (ASCII 10, \n). Dans le protocole HTTP, ces deux caractères à la suite permettent entre autres de passer à la ligne d'entête suivante.<br />Un script qui insère directement dans ses entêtes des données fournies par l'utilisateur peut alors se voir injecter des lignes d'entêtes qui seront interprétées par le navigateur de la victime.

source: CRLF solution
es: Comprobar los parámetros enviados por el usuario y evitando que se inserten CRLF mediante su filtrado.
fr: Vérifiez que les couples nom / valeur retournés dans les entêtes HTTP ne contiennent pas la suite de caractères CRLF.

source: Commands execution
es: Ejecución de comandos
fr: Exécution de commandes

source: Commands execution description
es: Este ataque consiste en ejecutar comandos del sistema en el servidor. El atacante intenta inyectar estos comandos en los parametros de la petición al servidor.
fr: Ce type d'attaque consiste à faire exécuter des commandes sur le serveur. L'attaquant tente d'injecter les commandes dans les paramêtres de requêtes qui lui sont accessibles.

source: Commands execution solution
es: Preferiblemente no usar las entradas de un usuario cuando se manejen llamadas al sistema de ficheros
fr: Evitez autant que possible de vous servir de données utilisateur dans vous appels de commandes.

source: Resource consumption
es: Consumo de recursos
fr: Epuisement de ressources

source: Resource consumption description
es: Un atacante puede forzar a una víctima a consumir más recursos de los que le está permitido consumir debido al nivel de acceso del atacante. El programa puede potencialmente fallar liberando un recurso del sistema o puede liberarlo incorrectamente. Si un recurso no es adecuadamente liberado no estará disponible para poder ser reutilizado. También puede ser un falso positivo debido al corto timeout usado en el para realizar el ataque.
fr: Un attaquant peut faire en sorte que le serveur consomme plus de ressources qu'il en utilise en temps normal. Certains défauts de conception peuvent rendre une ressource indisponible pendant un laps de temps après son accès. En répétant certaines requêtes mal gérées par le serveur ce dernier peut arriver à saturation.<br />Des faux positifs lors du scan peuvent aussi apparaîtrent sous cette catégorie en raison d'un timeout choisi trop faible.

source: Resource consumption solution
es: Configurar adecuadamente el software para evitar el consumo de memoria o la caída del sistema.
fr: Alléger les requêtes effectuées par l'application web pour les rendre moins gourmandes en utilisation mémoire et CPU.

source: File
es: Archivo
fr: Fichier

source: loaded, Wapiti will use it to perform the attacks
es: cargado, Wapiti lo usará para realizar los ataques
fr: chargé, Wapiti l'utilisera pour ses attaques

source: not found, Wapiti will scan again the web site
es: no encontrado, Wapiti escaneará de nuevo el sitio web
fr: non trouvé, Wapiti va lancer un nouveau scan du site web

source: loaded, the scan continues
es: cargado, el escaneo continua
fr: chargé, le scan continue

source: Notice
es: Aviso
fr: Note
