Repository: scriptonist/teknolab-wapiti
Catalog: src/language_sources/*.po
Languages: es, fr

source: Scan stopped, the data has been saved in the file
es: Escaneo detenido, la información ha sido guardada en el fichero
fr: Scan mis en pause, les données ont été sauvées dans le fichier

source: To continue this scan, you should launch Wapiti with
es: Para continuar el escaneo se debe lanzar Wapiti con la opción

source: parameter
es: como parametro

source: 500 HTTP Error code
es: Código de error HTTP 500
fr: Code d'erreur HTTP 500

source: Attack process interrupted. To perform again the attack, lauch Wapiti with "-i" or "-k" parameter.
es: Proceso de ataque interrumpido. Para realizar de nuevo el mismo ataque lanza Wapiti con el parametro "-i" o "-k"
fr: Le processus d'attaque a été stoppé. Pour le reprendre plus tard, lancez Wapiti avec les paramêtres "-i" ou "-k".

source: URLs to browse
es: URL a escanear
fr: URLs à traiter

source: URLs browsed
es: URL escaneadas
fr: URLs traitées

source: This scan has been saved in the file
es: El escaneo ha sido guardado en el fichero
fr: Cette session de scan a été enregistrée dans le fichier

source: You can use it to perform attacks without scanning again the web site with
es: Puede ser usado para realizar ataques sin necesidad de escanear nuevamente el sitio web con
fr: Vous pouvez l'utiliser pour lancer directements les attaques sans avoir à scanner le site à nouveau

source: injected from
es: inyectado desde
fr: injecté depuis

source: You can use it to perform attacks without scanning again the web site with the "-k" parameter
es: Puede ser usado para realizar ataques sin necesidad de escanear nuevamente el sitio web utilizando el parámetro "-k"
fr: Vous pouvez l'utiliser pour lancer des attaques sans scanner à nouveau le siteweb avec le paramêtre "-k"

source: To continue this scan, you should launch Wapiti with the "-i" parameter
es: Para continuar el escaneo, Wapiti deberá ser lanzado con el parámetro "-i"
fr: Si vous souhaitez reprendre ce scan, relancez Wapiti avec le paramêtre "-i"

source: Loading modules
es: Cargando módulos
fr: Chargement des modules

source: Found backup file !
es: Encontrado fichero de backup
fr: Fichier de sauvegarde trouvé !

source: Backup file found for
es: Fichero de backup encontrado para
fr: Fichier de sauvegarde trouvé pour

source: Problem with local nikto database.
es: Se ha encontrado un problema con la base de datos Nikto local.
fr: Un problème a été rencontré lors de la lecture de la base de données Nikto.

source: Downloading from the web...
es: Descargando de la web...
fr: Téléchargement depuis le web...

source: Error downloading Nikto database
es: Error al descargar la base de datos Nikto
fr: Erreur lors du téléchargement de la base de données Nikto

source: References:
es: Referencias:
fr: Références :

source: Missing dependecies for module
es: Dependencias perdidas para el módulo
fr: Dépendances manquantes pour le module

source: Launching module
es: Lanzando módulo
fr: Lancement du module

source: HtAccess protection found:
es: Protección HtAccess encontrada
fr: Protection htaccess trouvée :

source: Source code:
es: Códgo fuente
fr: Code source :

source: .htaccess bypass vulnerability:
es: Vulnerabilidad bypass .htaccess:
fr: Vulnérabilité de contournement de htaccess :

source: CRLF Injection
es: Inyección CRLF
fr: Injection CRLF

source: Remote include
es: incluido Remote
fr: Inclusion distante

source: MySQL Injection
es: Inyección MySQL
fr: Injection MySQL

source: Access-Based SQL Injection
es: Acceso basado en Inyección SQL
fr: Injection sur base Access

source: MSSQL-Based Injection
es: Inyección basada en MSSQL
fr: Injection MSSQL

source: Java.SQL Injection
es: Inyección Java.SQL
fr: Injection Java.SQL

source: PostgreSQL Injection
es: Inyección PostgreSQL
fr: Injection PostgreSQL

source: XPath Injection
es: Inyección XPath
fr: Injection XPath

source: LDAP Injection
es: Inyección LDAP
fr: Injection LDAP

source: DB2 Injection
es: Inyección DB2
fr: Injection DB2

source: Interbase Injection
es: Inyección Interbase
fr: Injection Interbase

source: Sybase Injection
es: Inyección Sybase
fr: Injection Sybase

source: Command execution
es: Ejecución de comando
fr: Exécution de commande

source: preg_replace injection
es: Inyección de preg_replace
fr: Injection par preg_replace

source: Oracle Injection
es: Inyección Oracle
fr: Injection Oracle

source: Error getting url
es: Error obteniendo la URL
fr: Erreur lors de l'ouverture de l'url

source: Error fetching page
es: Error al leer la página
fr: Erreur lors de la lecture de la page

source: No forms found in this page !
es: ¡No se han encontrado formularios en esta página!
fr: Aucun formulaire trouvé dans cette page !

source: Choose the form you want to use :
es: Debe escoger el formulario que va a ser usado:
fr: Choisissez le formulaire à utiliser :

source: Enter a number :
es: Introduzca un número
fr: Entrez un numéro :

source: Please enter values for the folling form :
es: Por favor, introduzca valores para el formulario:
fr: Veuillez entrez les valeurs pour le formulaire :

source: Error: The server did not understand this request
es: Error: Sin respuesta por parte del servidor
fr: Erreur : Le serveur n'a pas compris la requête

source: Backup file
es: Fichero de backup
fr: Copie de sauvegarde

source: Backup file description
es: Es posible encontrar ficheros de backup o scripts en el servidor web que el administrador del sitio haya puesto ahí para guardar una versión antigua o ficheros de backup que han sido generados automáticamente por algún editor (por ejemplo Emacs). Estas copias pueden revelar información relevante para un atacante como código fuente o credenciales
fr: Il se peut que des copies de sauvegarde de scripts soient accessibles sur le serveur. L'administrateur web a du placer volontairement une sauvegarde dans l'idée de revenir à une précédente version ou involontairement en utilisant un éditeur configuré pour sauver automatiquement une copie après une certaine durée.Ces fichiers peuvent révéler des informations intéressantes comme du code source ou encore des identifiants (accès à la base de données).

source: Backup file solution
es: El administrador del sitio debe manualmente borrar los ficheros de backup. También deberá reconfigurar su editor para desactivar la creación de estos ficheros de forma automática.
fr: L'administrateur web doit supprimer manuellement les sauvegardes présentes sous la racine web et reconfigurer l'éditeur qu'il utilise pour désactiver les sauvegardes automatiques.

source: Potentially dangerous file
es: Fichero potencialmente peligroso
fr: Fichiers potentiellement dangereux

source: Potentially dangerous file description
es: Ciertos scripts son conocidos por ser potencialmente vulnerables y peligrosos. Listas de este tipo de ficheros son frecuentemente utilizados por atacantes para escanear sitios de Internet a la búsqueda de este tipo de vulnerabilidades.
fr: Certains scripts sont connus pour être potentiellement vulnérables et dangereux. Des listes de tels fichiers existent et sont fréquemment utilisées par des attaquants pour scanner des sites Internet à la recherche de ces vulnarébilitées.

source: Potentially dangerous file solution
es: El administrador deberá actualizar regularmente a la última versión sus scripts y programas utilizados en els ervidor. También es aconsejado estar informado sobre las nuevas vulnerabilidades descubiertas, para ello sería conveniente estar sindicado a diferentes RSS sobre seguridad
fr: L'administrateur devrait vérifier régulièrement si des mises à jour sont disponibles pour les scripts et logiciels utilisés sur le serveur. Il est aussi conseillé de se tenir informé sur les nouvelles vulnérabilités trouvées en s'abonnant à des listes de sécurité ou en suivant des flux RSS spécialisés.

source: Htaccess Bypass
es: Bypass Htaccess
fr: Contournement de protection par htaccess

source: Htaccess bypass description
es: Los ficheros htaccess son usados para restringir el acceso sobre algunos ficheros mediante HTTP. En algunos casos es posible saltar esta restricción y acceder a estos ficheros.
fr: Les fichiers htaccess permettent de restreindre l'accès a des fichiers ou répertoires en fonction d'identifiants ou méthode HTTP utilisés. Si la configuration a été mal faite il peut être possible de contourner la restriction.

source: Htaccess bypass solution
es: Asegurarse de que los métodos HTTP están prohibidos si las credenciales no son correctas.
fr: La configuration du htaccess doit être minutieusement vérifiée pour ne pas laisser une porte d'entrée à un éventuel attaquant.

source: Raw XSS
es: XSS
fr: XSS brut

source: Found raw XSS in
es: XSS encontrado en
fr: XSS brut trouvé dans

source: CRLF
fr: Attaques CRLF
